Revit 2026 API

# RadioButtonGroupAddItems Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ToggleButton> AddItems(
	IList<ToggleButtonData> buttonData
)
```
```vb
Public Function AddItems (
	buttonData As IList(Of ToggleButtonData)
) As IList(Of ToggleButton)
```
```cpp
public:
IList<ToggleButton^>^ AddItems(
	IList<ToggleButtonData^>^ buttonData
)
```
```fsharp
member AddItems :
        buttonData : IList<ToggleButtonData> -> IList<ToggleButton>
```

#### Parameters

buttonData IListToggleButtonData

#### Return Value

IListToggleButton

#### Reference

RadioButtonGroup Class

Autodesk.Revit.UI Namespace